'''
Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.

Найдите количество и выведите его.
'''
# from random import randint
# list_1 = [randint(1, 10) for el in range(randint(10, 20))]
# k = randint(1, 10)
# print(list_1, k)
print(list_1.count(k))